<!DOCTYPE HTML><html lang="zh-hans"><head><meta charset="UTF-8"><meta content="text/html; charset=utf-8" http-equiv="Content-Type"><title>事务 · Aoang's Wiki</title><meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="description" content=""><meta name="generator" content="GitBook 3.2.3"><meta name="author" content="Aoang"><link rel="stylesheet" href="../gitbook/style.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css"><link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css"><meta name="HandheldFriendly" content="true"><meta name="viewport" content="width=device-width,initial-scale=1,user-scalable=no"><meta name="apple-mobile-web-app-capable" content="yes"><meta name="apple-mobile-web-app-status-bar-style" content="black"><link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png"><link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon"><link rel="next" href="2.3.索引.html"><link rel="prev" href="2.1.引擎.html"><link rel="shortcut icon" href="../favicon.ico" type="image/x-icon"><link rel="bookmark" href="../favicon.ico" type="image/x-icon"></head><body><div class="book"><div class="book-summary"><div id="book-search-input" role="search"><input type="text" placeholder="输入并搜索"></div><nav role="navigation"><ul class="summary"><li class="header">前言</li><li class="chapter" data-level="1.1" data-path="../"><a href="../"><b>1.1.</b> Introduction</a></li><li class="header">简言</li><li class="chapter" data-level="2.1" data-path="../简言/"><a href="../简言/"><b>2.1.</b> 简言</a></li><li class="header">Golang</li><li class="chapter" data-level="3.1" data-path="../golang/1.数据类型.html"><a href="../golang/1.数据类型.html"><b>3.1.</b> 数据类型</a><ul class="articles"><li class="chapter" data-level="3.1.1" data-path="../golang/1.1.基本数据类型.html"><a href="../golang/1.1.基本数据类型.html"><b>3.1.1.</b> 基本数据类型</a></li><li class="chapter" data-level="3.1.2" data-path="../golang/1.2.数组.html"><a href="../golang/1.2.数组.html"><b>3.1.2.</b> 数组</a></li><li class="chapter" data-level="3.1.3" data-path="../golang/1.3.切片.html"><a href="../golang/1.3.切片.html"><b>3.1.3.</b> 切片</a></li><li class="chapter" data-level="3.1.4" data-path="../golang/1.4.map.html"><a href="../golang/1.4.map.html"><b>3.1.4.</b> Map</a></li><li class="chapter" data-level="3.1.5" data-path="../golang/1.5.结构体.html"><a href="../golang/1.5.结构体.html"><b>3.1.5.</b> 结构体</a></li></ul></li><li class="chapter" data-level="3.2" data-path="../golang/2.语言特点.html"><a href="../golang/2.语言特点.html"><b>3.2.</b> 语言特点</a></li><li class="header">数据库</li><li class="chapter" data-level="4.1" data-path="1.数据库.html"><a href="1.数据库.html"><b>4.1.</b> 数据库</a><ul class="articles"><li class="chapter" data-level="4.1.1" data-path="1.1.范式.html"><a href="1.1.范式.html"><b>4.1.1.</b> 范式</a></li><li class="chapter" data-level="4.1.2" data-path="1.2.ACID.html"><a href="1.2.ACID.html"><b>4.1.2.</b> ACID</a></li><li class="chapter" data-level="4.1.3" data-path="1.3.扩展.html"><a href="1.3.扩展.html"><b>4.1.3.</b> 扩展</a></li><li class="chapter" data-level="4.1.4" data-path="1.4.冗余.html"><a href="1.4.冗余.html"><b>4.1.4.</b> 冗余</a></li><li class="chapter" data-level="4.1.5" data-path="1.5.ID.html"><a href="1.5.ID.html"><b>4.1.5.</b> 分布式 ID</a></li></ul></li><li class="chapter" data-level="4.2" data-path="2.简介.html"><a href="2.简介.html"><b>4.2.</b> MariaDB</a><ul class="articles"><li class="chapter" data-level="4.2.1" data-path="2.1.引擎.html"><a href="2.1.引擎.html"><b>4.2.1.</b> 引擎</a></li><li class="chapter active" data-level="4.2.2" data-path="2.2.事务.html"><a href="2.2.事务.html"><b>4.2.2.</b> 事务</a></li><li class="chapter" data-level="4.2.3" data-path="2.3.索引.html"><a href="2.3.索引.html"><b>4.2.3.</b> 索引</a></li><li class="chapter" data-level="4.2.4" data-path="2.4.优化.html"><a href="2.4.优化.html"><b>4.2.4.</b> 优化</a></li><li class="chapter" data-level="4.2.5" data-path="2.5.锁机制.html"><a href="2.5.锁机制.html"><b>4.2.5.</b> 锁机制</a></li><li class="chapter" data-level="4.2.6" data-path="2.6.数据类型.html"><a href="2.6.数据类型.html"><b>4.2.6.</b> 数据类型</a></li><li class="chapter" data-level="4.2.7" data-path="2.7.权限.html"><a href="2.7.权限.html"><b>4.2.7.</b> 权限</a></li><li class="chapter" data-level="4.2.8" data-path="2.8.删除.html"><a href="2.8.删除.html"><b>4.2.8.</b> 删除</a></li><li class="chapter" data-level="4.2.9" data-path="2.9.join.html"><a href="2.9.join.html"><b>4.2.9.</b> Join</a></li><li class="chapter" data-level="4.2.10" data-path="2.10.键.html"><a href="2.10.键.html"><b>4.2.10.</b> 键</a></li></ul></li><li class="chapter" data-level="4.3" data-path="0.简介.md"><span><b>4.3.</b> Redis</span></li><li class="chapter" data-level="4.4" data-path="0.简介.md"><span><b>4.4.</b> PostgreSQL</span></li><li class="chapter" data-level="4.5" data-path="0.简介.md"><span><b>4.5.</b> MongoDB</span></li><li class="chapter" data-level="4.6" data-path="0.简介.md"><span><b>4.6.</b> SQLite</span></li><li class="header">软件</li><li class="chapter" data-level="5.1" data-path="../nginx/nginx.html"><a href="../nginx/nginx.html"><b>5.1.</b> Nginx</a></li><li class="header">多线程并发</li><li class="chapter" data-level="6.1" data-path="../golang/0.简介.md"><span><b>6.1.</b> 多线程并发</span></li><li class="header">数据结构与算法</li><li class="chapter" data-level="7.1" data-path="../golang/0.简介.md"><span><b>7.1.</b> 数据结构与算法</span></li><li class="header">Linux</li><li class="chapter" data-level="8.1" data-path="../golang/0.简介.md"><span><b>8.1.</b> Debian</span></li><li class="chapter" data-level="8.2" data-path="../golang/0.简介.md"><span><b>8.2.</b> Arch</span></li><li class="chapter" data-level="8.3" data-path="../golang/0.简介.md"><span><b>8.3.</b> CentOS</span></li><li class="header">编程思想</li><li class="chapter" data-level="9.1" data-path="../golang/0.简介.md"><span><b>9.1.</b> 编程思想</span></li><li class="header">网络协议</li><li class="chapter" data-level="10.1" data-path="../golang/0.简介.md"><span><b>10.1.</b> 网络协议</span></li><li class="header">Docker</li><li class="chapter" data-level="11.1" data-path="../golang/0.简介.md"><span><b>11.1.</b> Docker</span></li><li class="header">Kubernetes</li><li class="chapter" data-level="12.1" data-path="../golang/0.简介.md"><span><b>12.1.</b> Kubernetes</span></li><li class="divider"></li><li><a href="https://www.gitbook.com" target="blank" class="gitbook-link">本书使用 GitBook 发布</a></li></ul></nav></div><div class="book-body"><div class="body-inner"><div class="book-header" role="navigation"><h1><i class="fa fa-circle-o-notch fa-spin"></i> <a href="..">事务</a></h1></div><div class="page-wrapper" tabindex="-1" role="main"><div class="page-inner"><div class="search-plus" id="book-search-results"><div class="search-noresults"><div id="book-search-results"><div class="search-noresults"><section class="normal markdown-section"><h1 id="&#x4E8B;&#x52A1;">&#x4E8B;&#x52A1;</h1><p>&#x6570;&#x636E;&#x5E93;&#x4E8B;&#x52A1;&#x901A;&#x5E38;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x7684;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#x3002;&#x5305;&#x542B;&#x6709;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x76EE;&#x7684;&#xFF1A;</p><p>&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x64CD;&#x4F5C;&#x5E8F;&#x5217;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x4ECE;&#x5931;&#x8D25;&#x4E2D;&#x6062;&#x590D;&#x5230;&#x6B63;&#x5E38;&#x72B6;&#x6001;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x5373;&#x4F7F;&#x5728;&#x5F02;&#x5E38;&#x72B6;&#x6001;&#x4E0B;&#x4ECD;&#x80FD;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#x3002; &#x5F53;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x5E76;&#x53D1;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E4B;&#x95F4;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x9694;&#x79BB;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x9632;&#x6B62;&#x5F7C;&#x6B64;&#x7684;&#x64CD;&#x4F5C;&#x4E92;&#x76F8;&#x5E72;&#x6270;&#x3002; &#x5F53;&#x4E8B;&#x52A1;&#x88AB;&#x63D0;&#x4EA4;&#x7ED9;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x8BE5;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x90FD;&#x6210;&#x529F;&#x5B8C;&#x6210;&#x4E14;&#x5176;&#x7ED3;&#x679C;&#x88AB;&#x6C38;&#x4E45;&#x4FDD;&#x5B58;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002; &#x5982;&#x679C;&#x4E8B;&#x52A1;&#x4E2D;&#x6709;&#x7684;&#x64CD;&#x4F5C;&#x6CA1;&#x6709;&#x6210;&#x529F;&#x5B8C;&#x6210;&#xFF0C;&#x5219;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x90FD;&#x9700;&#x8981;&#x56DE;&#x6EDA;&#xFF0C;&#x56DE;&#x5230;&#x4E8B;&#x52A1;&#x6267;&#x884C;&#x524D;&#x7684;&#x72B6;&#x6001;&#x3002; &#x540C;&#x65F6;&#xFF0C;&#x8BE5;&#x4E8B;&#x52A1;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x7684;&#x6267;&#x884C;&#x65E0;&#x5F71;&#x54CD;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x4E8B;&#x52A1;&#x90FD;&#x597D;&#x50CF;&#x5728;&#x72EC;&#x7ACB;&#x7684;&#x8FD0;&#x884C;&#x3002;</p><h3 id="&#x7279;&#x70B9;">&#x7279;&#x70B9;</h3><p>&#x4ECE;&#x4E1A;&#x52A1;&#x89D2;&#x5EA6;&#x51FA;&#x53D1;&#xFF0C;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E00;&#x7EC4;&#x64CD;&#x4F5C;&#x8981;&#x6C42;&#x4FDD;&#x6301; 4 &#x4E2A;&#x7279;&#x5F81;&#xFF1A;&#x539F;&#x5B50;&#x6027;&#x3001;&#x4E00;&#x81F4;&#x6027;&#x3001;&#x9694;&#x79BB;&#x6027;&#x3001;&#x6301;&#x4E45;&#x6027;&#x3002;</p><p>&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3; ACID&#xFF0C;&#x53EF;&#x4EE5;&#x770B; ACID &#x4E13;&#x6587;&#x3002;</p><h3 id="&#x9694;&#x79BB;&#x7EA7;&#x522B;">&#x9694;&#x79BB;&#x7EA7;&#x522B;</h3><h4 id="&#x5E76;&#x53D1;&#x4E8B;&#x52A1;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;">&#x5E76;&#x53D1;&#x4E8B;&#x52A1;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;</h4><ol><li><p>&#x66F4;&#x65B0;&#x4E22;&#x5931;&#xFF1A; &#x5F53;&#x4E24;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x4E8B;&#x52A1;&#x9009;&#x62E9;&#x540C;&#x4E00;&#x884C;&#xFF0C;&#x7136;&#x540E;&#x57FA;&#x4E8E;&#x6700;&#x521D;&#x9009;&#x5B9A;&#x7684;&#x503C;&#x66F4;&#x65B0;&#x8BE5;&#x884C;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x4E8B;&#x52A1;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#x95EE;&#x9898;&#x3002; &#x6700;&#x540E;&#x7684;&#x66F4;&#x65B0;&#x8986;&#x76D6;&#x4E86;&#x7531;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x6240;&#x505A;&#x7684;&#x66F4;&#x65B0;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x4E24;&#x4E2A;&#x7F16;&#x8F91;&#x4EBA;&#x5458;&#x5236;&#x4F5C;&#x4E86;&#x540C;&#x4E00;&#x6587;&#x6863;&#x7684;&#x7535;&#x5B50;&#x526F;&#x672C;&#x3002; &#x6BCF;&#x4E2A;&#x7F16;&#x8F91;&#x4EBA;&#x5458;&#x72EC;&#x7ACB;&#x5730;&#x66F4;&#x6539;&#x5176;&#x526F;&#x672C;&#xFF0C;&#x7136;&#x540E;&#x4FDD;&#x5B58;&#x66F4;&#x6539;&#x540E;&#x7684;&#x526F;&#x672C;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x8986;&#x76D6;&#x4E86;&#x539F;&#x59CB;&#x6587;&#x6863;&#x3002; &#x6700;&#x540E;&#x4FDD;&#x5B58;&#x5176;&#x66F4;&#x6539;&#x526F;&#x672C;&#x7684;&#x7F16;&#x8F91;&#x4EBA;&#x5458;&#x8986;&#x76D6;&#x53E6;&#x4E00;&#x4E2A;&#x7F16;&#x8F91;&#x4EBA;&#x5458;&#x6240;&#x505A;&#x7684;&#x66F4;&#x6539;&#x3002; &#x5982;&#x679C;&#x5728;&#x4E00;&#x4E2A;&#x7F16;&#x8F91;&#x4EBA;&#x5458;&#x5B8C;&#x6210;&#x5E76;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#x4E4B;&#x524D;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x7F16;&#x8F91;&#x4EBA;&#x5458;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x540C;&#x4E00;&#x6587;&#x4EF6;&#xFF0C;&#x5219;&#x53EF;&#x907F;&#x514D;&#x6B64;&#x95EE;&#x9898;&#x3002;</p></li><li><p>&#x810F;&#x8BFB;&#xFF1A; &#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6B63;&#x5728;&#x5BF9;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x505A;&#x4FEE;&#x6539;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x4E8B;&#x52A1;&#x5B8C;&#x6210;&#x5E76;&#x63D0;&#x4EA4;&#x524D;&#xFF0C;&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5C31;&#x5904;&#x4E8E;&#x4E0D;&#x4E00;&#x81F4;&#x72B6;&#x6001;&#x3002; &#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E5F;&#x6765;&#x8BFB;&#x53D6;&#x540C;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x52A0;&#x63A7;&#x5236;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E8B;&#x52A1;&#x8BFB;&#x53D6;&#x4E86;&#x8FD9;&#x4E9B;&#x810F;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x636E;&#x6B64;&#x505A;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;</p></li><li><p>&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF1A; &#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5728;&#x8BFB;&#x53D6;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x540E;&#x7684;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#xFF0C;&#x518D;&#x6B21;&#x8BFB;&#x53D6;&#x4EE5;&#x524D;&#x8BFB;&#x8FC7;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5374;&#x53D1;&#x73B0;&#x5176;&#x8BFB;&#x51FA;&#x7684;&#x6570;&#x636E;&#x5DF2;&#x7ECF;&#x53D1;&#x751F;&#x4E86;&#x6539;&#x53D8;&#x3001;&#x6216;&#x88AB;&#x5220;&#x9664;&#x4E86;&#x3002;</p></li><li><p>&#x5E7B;&#x8BFB;&#xFF1A; &#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6309;&#x76F8;&#x540C;&#x7684;&#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#x91CD;&#x65B0;&#x8BFB;&#x53D6;&#x4EE5;&#x524D;&#x68C0;&#x7D22;&#x8FC7;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5374;&#x53D1;&#x73B0;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x63D2;&#x5165;&#x4E86;&#x6EE1;&#x8DB3;&#x5176;&#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#x7684;&#x65B0;&#x6570;&#x636E;&#x3002;</p></li></ol><p>&#x5E7B;&#x8BFB;&#x548C;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x7684;&#x533A;&#x522B;&#xFF1A; &#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x7684;&#x91CD;&#x70B9;&#x662F;&#x4FEE;&#x6539;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x4E8B;&#x52A1;&#x4E2D;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8BFB;&#x7684;&#x6570;&#x636E;&#x548C;&#x7B2C;&#x4E8C;&#x6B21;&#x8BFB;&#x7684;&#x6570;&#x636E;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x56E0;&#x4E3A;&#x4E2D;&#x95F4;&#x6709;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x4E86;&#x4FEE;&#x6539;&#x3002; &#x5E7B;&#x8BFB;&#x7684;&#x91CD;&#x70B9;&#x5728;&#x4E8E;&#x65B0;&#x589E;&#x6216;&#x8005;&#x5220;&#x9664;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x4E8B;&#x52A1;&#x4E2D;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x548C;&#x7B2C;&#x4E8C;&#x6B21;&#x8BFB;&#x51FA;&#x6765;&#x7684;&#x8BB0;&#x5F55;&#x6570;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x56E0;&#x4E3A;&#x4E2D;&#x95F4;&#x6709;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x4E86;&#x63D2;&#x5165;&#x3001;&#x5220;&#x9664;&#x3002;</p><h5 id="&#x89E3;&#x51B3;&#x529E;&#x6CD5;">&#x89E3;&#x51B3;&#x529E;&#x6CD5;</h5><ul><li><p>&#x66F4;&#x65B0;&#x4E22;&#x5931;&#x901A;&#x5E38;&#x662F;&#x5E94;&#x8BE5;&#x5B8C;&#x5168;&#x907F;&#x514D;&#x7684;&#x3002; &#x4F46;&#x9632;&#x6B62;&#x66F4;&#x65B0;&#x4E22;&#x5931;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x5355;&#x9760;&#x6570;&#x636E;&#x5E93;&#x4E8B;&#x52A1;&#x63A7;&#x5236;&#x5668;&#x6765;&#x89E3;&#x51B3;&#xFF0C;&#x9700;&#x8981;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5BF9;&#x8981;&#x66F4;&#x65B0;&#x7684;&#x6570;&#x636E;&#x52A0;&#x5FC5;&#x8981;&#x7684;&#x9501;&#x6765;&#x89E3;&#x51B3;&#xFF0C;&#x9632;&#x6B62;&#x66F4;&#x65B0;&#x4E22;&#x5931;&#x5E94;&#x8BE5;&#x662F;&#x5E94;&#x7528;&#x7684;&#x8D23;&#x4EFB;&#x3002;</p></li><li><p>&#x810F;&#x8BFB;&#x3001;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x548C;&#x5E7B;&#x8BFB;&#x90FD;&#x662F;&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x5FC5;&#x987B;&#x7531;&#x6570;&#x636E;&#x5E93;&#x63D0;&#x4F9B;&#x4E00;&#x5B9A;&#x7684;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x673A;&#x5236;&#x6765;&#x89E3;&#x51B3;&#x3002; &#x8981;&#x4E48;&#x52A0;&#x9501;&#xFF0C;&#x5728;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x524D;&#x5BF9;&#x5176;&#x52A0;&#x9501;&#xFF0C;&#x963B;&#x6B62;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002; &#x8981;&#x4E48;&#x4F7F;&#x7528; MVCC&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;&#x591A;&#x7248;&#x672C;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4E0D;&#x7528;&#x52A0;&#x4EFB;&#x4F55;&#x9501;&#x3002; &#x5B83;&#x4F1A;&#x901A;&#x8FC7;&#x4E00;&#x5B9A;&#x673A;&#x5236;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x8BF7;&#x6C42;&#x65F6;&#x95F4;&#x70B9;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x6570;&#x636E;&#x5FEB;&#x7167;&#xFF0C;&#x5E76;&#x7528;&#x8FD9;&#x4E2A;&#x5FEB;&#x7167;&#x6765;&#x63D0;&#x4F9B;&#x4E00;&#x5B9A;&#x7EA7;&#x522B;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x8BFB;&#x53D6;&#x3002; &#x4ECE;&#x7528;&#x6237;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x597D;&#x8C61;&#x662F;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x540C;&#x4E00;&#x6570;&#x636E;&#x7684;&#x591A;&#x4E2A;&#x7248;&#x672C;&#x3002;</p></li></ul><p>SQL &#x6807;&#x51C6;&#x5B9A;&#x4E49;&#x4E86;&#x56DB;&#x7C7B;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x6BCF;&#x4E00;&#x79CD;&#x7EA7;&#x522B;&#x90FD;&#x89C4;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#x6240;&#x505A;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x54EA;&#x4E9B;&#x5728;&#x4E8B;&#x52A1;&#x5185;&#x548C;&#x4E8B;&#x52A1;&#x95F4;&#x662F;&#x53EF;&#x89C1;&#x7684;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x3002; &#x4F4E;&#x7EA7;&#x522B;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x4E00;&#x822C;&#x652F;&#x6301;&#x66F4;&#x9AD8;&#x7684;&#x5E76;&#x53D1;&#x5904;&#x7406;&#xFF0C;&#x5E76;&#x62E5;&#x6709;&#x66F4;&#x4F4E;&#x7684;&#x7CFB;&#x7EDF;&#x5F00;&#x9500;&#x3002;</p><h4 id="&#x7B2C;&#x4E00;&#x7EA7;&#x522B;&#xFF1A;&#x672A;&#x63D0;&#x4EA4;&#x8BFB;">&#x7B2C;&#x4E00;&#x7EA7;&#x522B;&#xFF1A;&#x672A;&#x63D0;&#x4EA4;&#x8BFB;</h4><ul><li>&#x6240;&#x6709;&#x4E8B;&#x52A1;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5176;&#x4ED6;&#x672A;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#x7684;&#x6267;&#x884C;&#x7ED3;&#x679C;</li><li>&#x672C;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x5F88;&#x5C11;&#x7528;&#x4E8E;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x6027;&#x80FD;&#x4E5F;&#x4E0D;&#x6BD4;&#x5176;&#x4ED6;&#x7EA7;&#x522B;&#x597D;&#x591A;&#x5C11;</li><li>&#x8BE5;&#x7EA7;&#x522B;&#x5F15;&#x53D1;&#x7684;&#x95EE;&#x9898;&#x662F;&#x810F;&#x8BFB;&#xFF0C;&#x8BFB;&#x53D6;&#x5230;&#x4E86;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;</li></ul><h4 id="&#x7B2C;&#x4E8C;&#x7EA7;&#x522B;&#xFF1A;&#x5DF2;&#x63D0;&#x4EA4;&#x8BFB;">&#x7B2C;&#x4E8C;&#x7EA7;&#x522B;&#xFF1A;&#x5DF2;&#x63D0;&#x4EA4;&#x8BFB;</h4><ul><li>&#x8FD9;&#x662F;&#x5927;&#x591A;&#x6570;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x7684;&#x9ED8;&#x8BA4;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x4F46;&#x4E0D;&#x662F; MariaDB&#x3001;MySQL &#x9ED8;&#x8BA4;&#x7684;</li><li>&#x5B83;&#x6EE1;&#x8DB3;&#x4E86;&#x9694;&#x79BB;&#x7684;&#x7B80;&#x5355;&#x5B9A;&#x4E49;&#xFF0C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x53EA;&#x80FD;&#x770B;&#x89C1;&#x5DF2;&#x7ECF;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#x6240;&#x505A;&#x7684;&#x6539;&#x53D8;</li><li>&#x8FD9;&#x79CD;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x662F;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#x6267;&#x884C;&#x76F8;&#x540C;&#x7684; select &#x8BED;&#x53E5;&#x65F6;&#x53EF;&#x80FD;&#x770B;&#x5230;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x7ED3;&#x679C;&#x3002; &#x5BFC;&#x81F4;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x7684;&#x539F;&#x56E0;&#x53EF;&#x80FD;&#x6709;&#xFF1A;<ul><li>&#x6709;&#x4E00;&#x4E2A;&#x4EA4;&#x53C9;&#x7684;&#x4E8B;&#x52A1;&#x6709;&#x65B0;&#x7684; commit&#xFF0C;&#x5BFC;&#x81F4;&#x4E86;&#x6570;&#x636E;&#x7684;&#x6539;&#x53D8;;</li><li>&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x88AB;&#x591A;&#x4E2A;&#x5B9E;&#x4F8B;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x540C;&#x4E00;&#x4E8B;&#x52A1;&#x7684;&#x5176;&#x4ED6;&#x5B9E;&#x4F8B;&#x5728;&#x8BE5;&#x5B9E;&#x4F8B;&#x5904;&#x7406;&#x5176;&#x95F4;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x65B0;&#x7684; commit</li></ul></li></ul><h4 id="&#x7B2C;&#x4E09;&#x7EA7;&#x522B;&#xFF1A;&#x53EF;&#x91CD;&#x590D;&#x8BFB;">&#x7B2C;&#x4E09;&#x7EA7;&#x522B;&#xFF1A;&#x53EF;&#x91CD;&#x590D;&#x8BFB;</h4><ul><li>&#x8FD9;&#x662F; MariaDB&#x3001;MySQL &#x9ED8;&#x8BA4;&#x7684;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;</li><li>&#x5B83;&#x786E;&#x4FDD;&#x540C;&#x4E00;&#x4E8B;&#x52A1;&#x7684;&#x591A;&#x4E2A;&#x5B9E;&#x4F8B;&#x5728;&#x5E76;&#x53D1;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x4F1A;&#x770B;&#x5230;&#x540C;&#x6837;&#x7684;&#x6570;&#x636E;&#x884C;</li><li>&#x6B64;&#x7EA7;&#x522B;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x5E7B;&#x8BFB;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x8BFB;&#x53D6;&#x67D0;&#x4E00;&#x8303;&#x56F4;&#x7684;&#x6570;&#x636E;&#x884C;&#x65F6;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x53C8;&#x5728;&#x8BE5;&#x8303;&#x56F4;&#x5185;&#x63D2;&#x5165;&#x4E86;&#x65B0;&#x884C;&#xFF0C;&#x5F53;&#x518D;&#x8BFB;&#x53D6;&#x8BE5;&#x8303;&#x56F4;&#x7684;&#x6570;&#x636E;&#x884C;&#x65F6;&#xFF0C;&#x4F1A;&#x51FA;&#x73B0;&#x5E7B;&#x8BFB;</li><li>InnoDB &#x901A;&#x8FC7; MVCC &#x673A;&#x5236;&#x3001;&#x95F4;&#x9699;&#x9501;&#x89E3;&#x51B3;&#x5E7B;&#x8BFB;&#x95EE;&#x9898;</li></ul><h6 id="mvcc">MVCC</h6><p>&#x5927;&#x591A;&#x6570;&#x636E;&#x5E93;&#x4E8B;&#x52A1;&#x578B;&#x5F15;&#x64CE;&#x5B9E;&#x73B0;&#x90FD;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x7684;&#x884C;&#x7EA7;&#x9501;&#x3002; &#x57FA;&#x4E8E;&#x63D0;&#x5347;&#x5E76;&#x53D1;&#x6027;&#x8003;&#x8651;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x540C;&#x65F6;&#x5B9E;&#x73B0;&#x4E86; MVCC&#xFF0C;&#x5305;&#x62EC; Oracle&#x3001;PostgreSQL&#xFF0C;&#x4E0D;&#x8FC7;&#x5B9E;&#x73B0;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#x3002;</p><p>MVCC &#x7684;&#x5B9E;&#x73B0;&#x662F;&#x901A;&#x8FC7;&#x4FDD;&#x5B58;&#x6570;&#x636E;&#x5728;&#x67D0;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x5FEB;&#x7167;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x4E0D;&#x7BA1;&#x5B9E;&#x73B0;&#x65F6;&#x95F4;&#x591A;&#x957F;&#xFF0C;&#x6BCF;&#x4E2A;&#x4E8B;&#x7269;&#x770B;&#x5230;&#x7684;&#x6570;&#x636E;&#x90FD;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002; &#x5206;&#x4E3A;&#x4E50;&#x89C2;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x548C;&#x60B2;&#x89C2;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x3002;</p><p>InnoDB &#x7684; MVCC &#x901A;&#x8FC7;&#x5728;&#x6BCF;&#x884C;&#x8BB0;&#x5F55;&#x540E;&#x9762;&#x4FDD;&#x5B58;&#x4E24;&#x4E2A;&#x9690;&#x85CF;&#x7684;&#x5217;&#x6765;&#x5B9E;&#x73B0;&#x3002; &#x8FD9;&#x4E24;&#x4E2A;&#x5217;&#x4E00;&#x4E2A;&#x4FDD;&#x5B58;&#x4E86;&#x884C;&#x7684;&#x521B;&#x5EFA;&#x65F6;&#x95F4;&#xFF0C;&#x4E00;&#x4E2A;&#x4FDD;&#x5B58;&#x884C;&#x7684;&#x8FC7;&#x671F;&#x65F6;&#x95F4;&#x3002; &#x5F53;&#x7136;&#x5B58;&#x50A8;&#x7684;&#x5E76;&#x4E0D;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x65F6;&#x95F4;&#x800C;&#x662F;&#x7CFB;&#x7EDF;&#x7248;&#x672C;&#x53F7;&#x3002; &#x6BCF;&#x5F00;&#x59CB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4E8B;&#x52A1;&#xFF0C;&#x7CFB;&#x7EDF;&#x7248;&#x672C;&#x53F7;&#x90FD;&#x4F1A;&#x81EA;&#x52A8;&#x65B0;&#x589E;&#x3002; &#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x65F6;&#x523B;&#x7684;&#x7CFB;&#x7EDF;&#x7248;&#x672C;&#x53F7;&#x4F1A;&#x4F5C;&#x4E3A;&#x4E8B;&#x52A1;&#x7684;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x7528;&#x6765;&#x67E5;&#x8BE2;&#x5230;&#x6BCF;&#x884C;&#x8BB0;&#x5F55;&#x7684;&#x7248;&#x672C;&#x53F7;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;</p><p>&#x7B2C;&#x4E09;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E0B; MVCC &#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#xFF1A;</p><ul><li><p>SELECT &#x53EA;&#x67E5;&#x627E;&#x7248;&#x672C;&#x65E9;&#x4E8E;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x7248;&#x672C;&#x7684;&#x6570;&#x636E;&#x884C;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x4E8B;&#x52A1;&#x8BFB;&#x53D6;&#x7684;&#x884C;&#x8981;&#x4E48;&#x662F;&#x5728;&#x5F00;&#x59CB;&#x4E8B;&#x52A1;&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x8981;&#x4E48;&#x662F;&#x4E8B;&#x52A1;&#x81EA;&#x8EAB;&#x63D2;&#x5165;&#x6216;&#x8005;&#x4FEE;&#x6539;&#x8FC7;&#x7684;&#x3002; &#x884C;&#x7684;&#x5220;&#x9664;&#x7248;&#x672C;&#x53F7;&#x8981;&#x4E48;&#x672A;&#x5B9A;&#x4E49;&#xFF0C;&#x8981;&#x4E48;&#x5927;&#x4E8E;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x4E8B;&#x52A1;&#x8BFB;&#x53D6;&#x5230;&#x7684;&#x884C;&#x5728;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#x672A;&#x88AB;&#x5220;&#x9664;&#x3002; &#x53EA;&#x6709;&#x7B26;&#x5408;&#x4E0A;&#x8FF0;&#x4E24;&#x4E2A;&#x6761;&#x4EF6;&#x7684;&#x624D;&#x4F1A;&#x88AB;&#x67E5;&#x8BE2;&#x51FA;&#x6765;&#x3002;</p></li><li><p>INSERT &#x4E3A;&#x65B0;&#x63D2;&#x5165;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#x4FDD;&#x5B58;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x7248;&#x672C;&#x53F7;&#x4F5C;&#x4E3A;&#x884C;&#x7248;&#x672C;&#x53F7;&#x3002;</p></li></ul><ul><li><p>DELETE &#x4E3A;&#x5220;&#x9664;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#x4FDD;&#x5B58;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x7248;&#x672C;&#x53F7;&#x4F5C;&#x4E3A;&#x884C;&#x5220;&#x9664;&#x6807;&#x8BC6;&#x3002;</p></li><li><p>UPDATE &#x4E3A;&#x63D2;&#x5165;&#x7684;&#x4E00;&#x884C;&#x65B0;&#x7EAA;&#x5F55;&#x4FDD;&#x5B58;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x7248;&#x672C;&#x53F7;&#x4F5C;&#x4E3A;&#x884C;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x540C;&#x65F6;&#x4FDD;&#x5B58;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x7248;&#x672C;&#x53F7;&#x5230;&#x539F;&#x6765;&#x7684;&#x884C;&#x4F5C;&#x4E3A;&#x5220;&#x9664;&#x6807;&#x8BC6;&#x3002;</p></li></ul><p>&#x4FDD;&#x5B58;&#x8FD9;&#x4E24;&#x4E2A;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x4F7F;&#x5927;&#x591A;&#x6570;&#x64CD;&#x4F5C;&#x90FD;&#x4E0D;&#x7528;&#x52A0;&#x9501;&#x3002;&#x4F7F;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x7B80;&#x5355;&#xFF0C;&#x6027;&#x80FD;&#x5F88;&#x597D;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x4FDD;&#x8BC1;&#x53EA;&#x4F1A;&#x8BFB;&#x53D6;&#x5230;&#x590D;&#x5408;&#x8981;&#x6C42;&#x7684;&#x884C;&#x3002; &#x4E0D;&#x8DB3;&#x4E4B;&#x5904;&#x662F;&#x6BCF;&#x884C;&#x8BB0;&#x5F55;&#x90FD;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x9700;&#x8981;&#x505A;&#x66F4;&#x591A;&#x7684;&#x884C;&#x68C0;&#x67E5;&#x5DE5;&#x4F5C;&#x548C;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x7EF4;&#x62A4;&#x5DE5;&#x4F5C;&#x3002;</p><p>MVCC &#x53EA;&#x5728;&#x7B2C;&#x4E8C;&#x4E09;&#x4E24;&#x79CD;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E0B;&#x5DE5;&#x4F5C;&#x3002; &#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;MVCC&#x662F;&#x884C;&#x7EA7;&#x9501;&#x4E00;&#x4E2A;&#x53D8;&#x79CD;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x907F;&#x514D;&#x4E86;&#x52A0;&#x9501;&#x64CD;&#x4F5C;&#xFF0C;&#x5F00;&#x9500;&#x66F4;&#x4F4E;&#x3002; &#x867D;&#x7136;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5B9E;&#x73B0;&#x673A;&#x5236;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x5927;&#x90FD;&#x5B9E;&#x73B0;&#x4E86;&#x975E;&#x963B;&#x585E;&#x7684;&#x8BFB;&#x64CD;&#x4F5C;&#xFF0C;&#x8BFB;&#x4E0D;&#x7528;&#x52A0;&#x9501;&#xFF0C;&#x4E14;&#x80FD;&#x907F;&#x514D;&#x51FA;&#x73B0;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x548C;&#x5E7B;&#x8BFB;&#x3002; &#x5199;&#x64CD;&#x4F5C;&#x4E5F;&#x53EA;&#x9501;&#x5B9A;&#x5FC5;&#x8981;&#x7684;&#x884C;&#xFF0C;&#x5199;&#x5FC5;&#x987B;&#x52A0;&#x9501;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x540C;&#x4E8B;&#x52A1;&#x5E76;&#x53D1;&#x5199;&#x4F1A;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x4E0D;&#x4E00;&#x81F4;&#x3002;</p><h4 id="&#x7B2C;&#x56DB;&#x7EA7;&#x522B;&#xFF1A;&#x53EF;&#x4E32;&#x884C;&#x8BFB;">&#x7B2C;&#x56DB;&#x7EA7;&#x522B;&#xFF1A;&#x53EF;&#x4E32;&#x884C;&#x8BFB;</h4><ul><li>&#x8FD9;&#x662F;&#x6700;&#x9AD8;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x5F3A;&#x5236;&#x4E8B;&#x52A1;&#x6392;&#x5E8F;&#xFF0C;&#x4F7F;&#x4E4B;&#x4E0D;&#x53EF;&#x80FD;&#x76F8;&#x4E92;&#x51B2;&#x7A81;&#xFF0C;&#x4ECE;&#x800C;&#x89E3;&#x51B3;&#x5E7B;&#x8BFB;&#x95EE;&#x9898;</li><li>&#x5B83;&#x5728;&#x6BCF;&#x4E2A;&#x8BFB;&#x7684;&#x6570;&#x636E;&#x884C;&#x4E0A;&#x52A0;&#x4E0A;&#x5171;&#x4EAB;&#x9501;</li><li>&#x5728;&#x8FD9;&#x4E2A;&#x7EA7;&#x522B;&#xFF0C;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x5927;&#x91CF;&#x7684;&#x8D85;&#x65F6;&#x73B0;&#x8C61;&#x548C;&#x9501;&#x7ADE;&#x4E89;</li></ul><h4 id="&#x9694;&#x79BB;&#x7EA7;&#x522B;">&#x9694;&#x79BB;&#x7EA7;&#x522B;</h4><table><thead><tr><th style="text-align:center">&#x9694;&#x79BB;&#x7EA7;&#x522B;</th><th style="text-align:center">&#x810F;&#x8BFB;</th><th style="text-align:center">&#x4E22;&#x5931;&#x66F4;&#x65B0;</th><th style="text-align:center">&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;</th><th style="text-align:center">&#x5E7B;&#x8BFB;</th></tr></thead><tbody><tr><td style="text-align:center">&#x672A;&#x63D0;&#x4EA4;&#x8BFB;</td><td style="text-align:center">&#x2714;&#xFE0F;</td><td style="text-align:center">&#x2714;&#xFE0F;</td><td style="text-align:center">&#x2714;&#xFE0F;</td><td style="text-align:center">&#x2714;&#xFE0F;</td></tr><tr><td style="text-align:center">&#x5DF2;&#x63D0;&#x4EA4;&#x8BFB;</td><td style="text-align:center">&#x274C;</td><td style="text-align:center">&#x274C;</td><td style="text-align:center">&#x2714;&#xFE0F;</td><td style="text-align:center">&#x2714;&#xFE0F;</td></tr><tr><td style="text-align:center">&#x53EF;&#x91CD;&#x590D;&#x8BFB;</td><td style="text-align:center">&#x274C;</td><td style="text-align:center">&#x274C;</td><td style="text-align:center">&#x274C;</td><td style="text-align:center">&#x2714;&#xFE0F;</td></tr><tr><td style="text-align:center">&#x53EF;&#x4E32;&#x884C;&#x8BFB;</td><td style="text-align:center">&#x274C;</td><td style="text-align:center">&#x274C;</td><td style="text-align:center">&#x274C;</td><td style="text-align:center">&#x274C;</td></tr></tbody></table><p>&#x5404;&#x6570;&#x636E;&#x5E93;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x5B8C;&#x5168;&#x5B9E;&#x73B0;&#x4E86;&#x56DB;&#x4E2A;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3002;</p><p>Oracle &#x53EA;&#x63D0;&#x4F9B; Read committed &#x548C; Serializable &#x4E24;&#x4E2A;&#x6807;&#x51C6;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x53E6;&#x5916;&#x8FD8;&#x63D0;&#x4F9B;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;&#x7684; Read only &#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3002;</p><p>SQL Server &#x9664;&#x652F;&#x6301;&#x8FD9;&#x4E9B;&#x7EA7;&#x522B;&#x5916;&#xFF0C;&#x8FD8;&#x652F;&#x6301;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x5FEB;&#x7167;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x4F46;&#x4E25;&#x683C;&#x6765;&#x8BF4;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x7528; MVCC &#x5B9E;&#x73B0;&#x7684; Serializable &#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3002;</p><p>MariaDB&#x3001;MySQL &#x90FD;&#x652F;&#x6301;&#xFF0C;&#x4F46;&#x5728;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x65F6;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x7279;&#x70B9;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x4E00;&#x4E9B;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E0B;&#x662F;&#x91C7;&#x7528; MVCC &#x4E00;&#x81F4;&#x6027;&#x8BFB;&#xFF0C;&#x4F46;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x53C8;&#x4E0D;&#x662F;&#x3002;</p><p>Mysql&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6267;&#x884C; <code>set transaction isolation level</code> &#x547D;&#x4EE4;&#x6765;&#x8BBE;&#x7F6E;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x65B0;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4F1A;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#x751F;&#x6548;&#x3002; &#x4F8B;&#x5982;&#xFF1A;<code>set session transaction isolation level read committed;</code></p><h3 id="&#x4E8B;&#x52A1;&#x65E5;&#x5FD7;">&#x4E8B;&#x52A1;&#x65E5;&#x5FD7;</h3><ul><li><p>&#x4F7F;&#x7528;&#x4E8B;&#x52A1;&#x65E5;&#x5FD7;&#xFF0C;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x5728;&#x4FEE;&#x6539;&#x8868;&#x7684;&#x6570;&#x636E;&#x65F6;&#x53EA;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x5176;&#x5185;&#x5B58;&#x62F7;&#x8D1D;&#xFF0C;&#x518D;&#x628A;&#x8BE5;&#x4FEE;&#x6539;&#x884C;&#x4E3A;&#x8BB0;&#x5F55;&#x5230;&#x6301;&#x4E45;&#x5728;&#x786C;&#x76D8;&#x4E0A;&#x7684;&#x4E8B;&#x52A1;&#x65E5;&#x5FD7;&#x4E2D;&#x3002; &#x4E0D;&#x7528;&#x6BCF;&#x6B21;&#x90FD;&#x5C06;&#x4FEE;&#x6539;&#x7684;&#x6570;&#x636E;&#x672C;&#x8EAB;&#x6301;&#x4E45;&#x5230;&#x78C1;&#x76D8;&#x3002;</p></li><li><p>&#x4E8B;&#x52A1;&#x65E5;&#x5FD7;&#x91C7;&#x7528;&#x7684;&#x662F;&#x8FFD;&#x52A0;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x5199;&#x65E5;&#x5FD7;&#x7684;&#x64CD;&#x4F5C;&#x662F;&#x78C1;&#x76D8;&#x4E0A;&#x4E00;&#x5C0F;&#x5757;&#x533A;&#x57DF;&#x5185;&#x7684;&#x987A;&#x5E8F; I/O &#xFF0C;&#x800C;&#x4E0D;&#x50CF;&#x968F;&#x673A;I/O&#x9700;&#x8981;&#x5728;&#x78C1;&#x76D8;&#x7684;&#x591A;&#x4E2A;&#x5730;&#x65B9;&#x79FB;&#x52A8;&#x78C1;&#x5934;&#x3002; &#x91C7;&#x7528;&#x4E8B;&#x52A1;&#x65E5;&#x5FD7;&#x7684;&#x65B9;&#x5F0F;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x8981;&#x5FEB;&#x5F97;&#x591A;&#x3002;</p></li><li><p>&#x4E8B;&#x52A1;&#x65E5;&#x5FD7;&#x6301;&#x4E45;&#x4EE5;&#x540E;&#xFF0C;&#x5185;&#x5B58;&#x4E2D;&#x88AB;&#x4FEE;&#x6539;&#x7684;&#x6570;&#x636E;&#x5728;&#x540E;&#x53F0;&#x53EF;&#x4EE5;&#x6162;&#x6162;&#x5237;&#x56DE;&#x5230;&#x78C1;&#x76D8;&#x3002;</p></li><li><p>&#x5982;&#x679C;&#x6570;&#x636E;&#x7684;&#x4FEE;&#x6539;&#x5DF2;&#x7ECF;&#x8BB0;&#x5F55;&#x5230;&#x4E8B;&#x52A1;&#x65E5;&#x5FD7;&#x5E76;&#x6301;&#x4E45;&#x5316;&#xFF0C;&#x4F46;&#x6570;&#x636E;&#x672C;&#x8EAB;&#x6CA1;&#x6709;&#x5199;&#x56DE;&#x5230;&#x78C1;&#x76D8;&#xFF0C;&#x6B64;&#x65F6;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#xFF0C;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x5728;&#x91CD;&#x542F;&#x65F6;&#x80FD;&#x591F;&#x81EA;&#x52A8;&#x6062;&#x590D;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x4FEE;&#x6539;&#x7684;&#x6570;&#x636E;&#x3002;</p></li></ul><p>&#x76EE;&#x524D;&#x6765;&#x8BF4;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x901A;&#x5E38;&#x79F0;&#x4E4B;&#x4E3A;&#x9884;&#x5199;&#x5F0F;&#x65E5;&#x5FD7;&#xFF0C;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x9700;&#x8981;&#x5199;&#x4E24;&#x6B21;&#x78C1;&#x76D8;&#x3002;</p><h3 id="&#x5B9E;&#x73B0;&#x539F;&#x7406;">&#x5B9E;&#x73B0;&#x539F;&#x7406;</h3><p>&#x4E8B;&#x52A1;&#x7684;&#x5B9E;&#x73B0;&#x662F;&#x57FA;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x5BF9;&#x4E8B;&#x52A1;&#x7684;&#x652F;&#x6301;&#x7A0B;&#x5EA6;&#x4E0D;&#x4E00;&#x6837;&#x3002;</p><p>InnoDB &#x662F; MariaDB &#x9ED8;&#x8BA4;&#x7684;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#xFF0C;&#x9ED8;&#x8BA4;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x662F;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E0B;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#xFF0C;&#x52A0;&#x5165;&#x4E86; MVCC &#x548C; &#x95F4;&#x9699;&#x9501;&#x3002;</p><p>&#x56E0;&#x6B64; InnoDB &#x7684;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x5176;&#x5B9E;&#x5B9E;&#x73B0;&#x4E86;&#x4E32;&#x884C;&#x5316;&#x7EA7;&#x522B;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x800C;&#x4E14;&#x4FDD;&#x7559;&#x4E86;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x5E76;&#x53D1;&#x6027;&#x80FD;&#x3002;</p><p>&#x4E8B;&#x52A1;&#x7684;&#x9694;&#x79BB;&#x6027;&#x662F;&#x901A;&#x8FC7;&#x9501;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x4E8B;&#x52A1;&#x7684;&#x539F;&#x5B50;&#x6027;&#x3001;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x6301;&#x4E45;&#x6027;&#x5219;&#x662F;&#x901A;&#x8FC7;&#x4E8B;&#x52A1;&#x65E5;&#x5FD7;&#x5B9E;&#x73B0;&#x3002;&#x8BF4;&#x5230;&#x4E8B;&#x52A1;&#x65E5;&#x5FD7;&#x5C31;&#x5F97;&#x63D0;&#x4E00;&#x4E0B; redo &#x548C; undo&#x3002;</p><ul><li>redo log</li></ul><p>&#x4E8B;&#x52A1;&#x65E5;&#x5FD7;&#x901A;&#x8FC7;&#x91CD;&#x505A; (redo) &#x65E5;&#x5FD7;&#x548C;&#x65E5;&#x5FD7;&#x7F13;&#x51B2; (InnoDB Log Buffer) &#x5B9E;&#x73B0;&#x3002; &#x4E8B;&#x52A1;&#x5F00;&#x542F;&#x65F6;&#xFF0C;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x4F1A;&#x5148;&#x5199;&#x5165;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x7684;&#x65E5;&#x5FD7;&#x7F13;&#x51B2;&#x4E2D;&#xFF0C;&#x5728;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x4E4B;&#x524D;&#xFF0C;&#x8FD9;&#x4E9B;&#x7F13;&#x51B2;&#x7684;&#x65E5;&#x5FD7;&#x90FD;&#x9700;&#x8981;&#x63D0;&#x524D;&#x5237;&#x65B0;&#x5230;&#x78C1;&#x76D8;&#x4E0A;&#x6301;&#x4E45;&#x5316;&#x3002; &#x8FD9;&#x5C31;&#x662F;&#x9884;&#x5199;&#x65E5;&#x5FD7;&#x3002;</p><p>&#x5F53;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x4E4B;&#x540E;&#xFF0C;&#x5728; Buffer Pool &#x4E2D;&#x6620;&#x5C04;&#x7684;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x624D;&#x4F1A;&#x6162;&#x6162;&#x5237;&#x65B0;&#x5230;&#x78C1;&#x76D8;&#x3002; &#x6B64;&#x65F6;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x5D29;&#x6E83;&#x6216;&#x8005;&#x5B95;&#x673A;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x7CFB;&#x7EDF;&#x91CD;&#x542F;&#x8FDB;&#x884C;&#x6062;&#x590D;&#x65F6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6839;&#x636E; redo log &#x4E2D;&#x8BB0;&#x5F55;&#x7684;&#x65E5;&#x5FD7;&#xFF0C;&#x628A;&#x6570;&#x636E;&#x5E93;&#x6062;&#x590D;&#x5230;&#x5D29;&#x6E83;&#x524D;&#x7684;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x3002; &#x672A;&#x5B8C;&#x6210;&#x7684;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x63D0;&#x4EA4;&#x4E5F;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x56DE;&#x6EDA;&#xFF0C;&#x8FD9;&#x57FA;&#x4E8E;&#x6062;&#x590D;&#x7684;&#x7B56;&#x7565;&#x800C;&#x5B9A;&#x3002;</p><ul><li><p>undo log undo log &#x4E3B;&#x8981;&#x4E3A;&#x4E8B;&#x52A1;&#x7684;&#x56DE;&#x6EDA;&#x670D;&#x52A1;&#x3002; &#x5728;&#x4E8B;&#x52A1;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x9664;&#x4E86;&#x8BB0;&#x5F55; redo log&#xFF0C;&#x8FD8;&#x4F1A;&#x8BB0;&#x5F55;&#x4E00;&#x5B9A;&#x91CF;&#x7684; undo log&#x3002; undo log &#x8BB0;&#x5F55;&#x4E86;&#x6570;&#x636E;&#x5728;&#x6BCF;&#x4E2A;&#x64CD;&#x4F5C;&#x524D;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x9700;&#x8981;&#x56DE;&#x6EDA;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6839;&#x636E; undo log &#x8FDB;&#x884C;&#x56DE;&#x6EDA;&#x64CD;&#x4F5C;&#x3002; &#x5355;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x56DE;&#x6EDA;&#xFF0C;&#x53EA;&#x4F1A;&#x56DE;&#x6EDA;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x505A;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x5176;&#x4ED6;&#x7684;&#x4E8B;&#x52A1;&#x505A;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p></li><li><p>&#x5F00;&#x59CB;&#x4E8B;&#x52A1;</p></li><li>&#x8BB0;&#x5F55; A=1 &#x5230; undo log</li><li>update A = 3</li><li>&#x8BB0;&#x5F55; A=3 &#x5230; redo log</li><li>&#x8BB0;&#x5F55; B=2 &#x5230; undo log</li><li>update B = 4</li><li>&#x8BB0;&#x5F55;B = 4 &#x5230;redo log</li><li>&#x5C06; redo log &#x5237;&#x65B0;&#x5230;&#x78C1;&#x76D8;</li><li>&#x63D0;&#x4EA4;</li></ul><p>&#x5728; 1 - 8 &#x7684;&#x4EFB;&#x610F;&#x4E00;&#x6B65;&#x7CFB;&#x7EDF;&#x5B95;&#x673A;&#xFF0C;&#x4E8B;&#x52A1;&#x672A;&#x63D0;&#x4EA4;&#xFF0C;&#x8BE5;&#x4E8B;&#x52A1;&#x5C31;&#x4E0D;&#x4F1A;&#x5BF9;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x505A;&#x4EFB;&#x4F55;&#x5F71;&#x54CD;&#x3002; &#x5728; 8 - 9 &#x7CFB;&#x7EDF;&#x5B95;&#x673A;&#xFF0C;&#x6062;&#x590D;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x56DE;&#x6EDA;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x7EE7;&#x7EED;&#x5B8C;&#x6210;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#xFF0C;&#x56E0;&#x4E3A;&#x6B64;&#x65F6; redo log &#x5DF2;&#x7ECF;&#x6301;&#x4E45;&#x5316;&#x3002; &#x82E5;&#x5728; 9 &#x4E4B;&#x540E;&#x7CFB;&#x7EDF;&#x5B95;&#x673A;&#xFF0C;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x4E2D;&#x53D8;&#x66F4;&#x7684;&#x6570;&#x636E;&#x8FD8;&#x6765;&#x4E0D;&#x53CA;&#x5237;&#x56DE;&#x78C1;&#x76D8;&#xFF0C;&#x90A3;&#x4E48;&#x7CFB;&#x7EDF;&#x6062;&#x590D;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E; redo log &#x628A;&#x6570;&#x636E;&#x5237;&#x56DE;&#x78C1;&#x76D8;&#x3002;</p><p>&#x6240;&#x4EE5;&#xFF0C;redo log &#x5176;&#x5B9E;&#x4FDD;&#x969C;&#x7684;&#x662F;&#x4E8B;&#x52A1;&#x7684;&#x6301;&#x4E45;&#x6027;&#x548C;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x800C; undo log &#x5219;&#x4FDD;&#x969C;&#x4E86;&#x4E8B;&#x52A1;&#x7684;&#x539F;&#x5B50;&#x6027;&#x3002;</p><h3 id="&#x4E8B;&#x52A1;&#x4F7F;&#x7528;">&#x4E8B;&#x52A1;&#x4F7F;&#x7528;</h3><ul><li><code>START TRANSACTION</code> &#x6216; <code>BEGIN</code> &#x5F00;&#x59CB;&#x4E8B;&#x52A1;</li><li><code>COMMIT</code> &#x63D0;&#x4EA4;</li><li><code>ROLLBACK</code> &#x56DE;&#x6EDA;</li><li><code>CHAIN</code> &#x5728;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x6216;&#x8005;&#x56DE;&#x6EDA;&#x4E4B;&#x540E;&#x4F1A;&#x7ACB;&#x5373;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x65B0;&#x4E8B;&#x52A1;&#xFF0C;&#x5E76;&#x4E14;&#x548C;&#x521A;&#x624D;&#x7684;&#x4E8B;&#x52A1;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;</li><li><code>RELEASE</code> &#x5728;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x6216;&#x8005;&#x56DE;&#x6EDA;&#x4E4B;&#x540E;&#x4F1A;&#x65AD;&#x5F00;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x8FDE;&#x63A5;&#x3002;</li><li><code>SET AUTOCOMMIT</code> &#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x5F53;&#x524D;&#x8FDE;&#x63A5;&#x7684;&#x63D0;&#x4EA4;&#x65B9;&#x5F0F;&#xFF0C;&#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x4E86; <code>SET AUTOCOMMIT=0</code>&#xFF0C;&#x5219;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x660E;&#x786E;&#x7684;&#x547D;&#x4EE4;&#x8FDB;&#x884C;&#x63D0;&#x4EA4;&#x6216;&#x8005;&#x56DE;&#x6EDA;</li></ul><p>&#x6CE8;&#x610F;&#x70B9;&#xFF1A;</p><ul><li>&#x5728;&#x9501;&#x8868;&#x671F;&#x95F4;&#x7528; start transaction &#x547D;&#x4EE4;&#x5F00;&#x59CB;&#x4E00;&#x4E2A;&#x65B0;&#x4E8B;&#x52A1;&#xFF0C;&#x4F1A;&#x9020;&#x6210;&#x4E00;&#x4E2A;&#x9690;&#x542B;&#x7684; unlock tables &#x88AB;&#x6267;&#x884C;</li><li>&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#xFF0C;&#x6700;&#x597D;&#x4E0D;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x7684;&#x8868;&#xFF0C;&#x5426;&#x5219; ROLLBACK &#x65F6;&#x9700;&#x8981;&#x5BF9;&#x975E;&#x4E8B;&#x52A1;&#x7C7B;&#x578B;&#x7684;&#x8868;&#x8FDB;&#x884C;&#x7279;&#x522B;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x56E0;&#x4E3A; COMMIT&#x3001;ROLLBACK &#x53EA;&#x80FD;&#x5BF9;&#x4E8B;&#x52A1;&#x7C7B;&#x578B;&#x7684;&#x8868;&#x8FDB;&#x884C;&#x63D0;&#x4EA4;&#x548C;&#x56DE;&#x6EDA;</li><li>&#x6240;&#x6709;&#x7684; DDL &#x8BED;&#x53E5;&#x662F;&#x4E0D;&#x80FD;&#x56DE;&#x6EDA;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x90E8;&#x5206;&#x7684; DDL &#x8BED;&#x53E5;&#x4F1A;&#x9020;&#x6210;&#x9690;&#x5F0F;&#x7684;&#x63D0;&#x4EA4;</li><li>&#x5728;&#x4E8B;&#x52A1;&#x4E2D;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B9A;&#x4E49; SAVEPOINT &#x6307;&#x5B9A;&#x56DE;&#x6EDA;&#x4E8B;&#x52A1;&#x7684;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x80FD;&#x6307;&#x5B9A;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#x7684;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#x3002; &#x5BF9;&#x4E8E;&#x590D;&#x6742;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7684; SAVEPOINT&#xFF0C;&#x6EE1;&#x8DB3;&#x4E0D;&#x540C;&#x7684;&#x6761;&#x4EF6;&#x65F6;&#xFF0C;&#x56DE;&#x6EDA;&#x4E0D;&#x540C;&#x7684; SAVEPOINT&#x3002; &#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x5B9A;&#x4E49;&#x4E86;&#x76F8;&#x540C;&#x540D;&#x5B57;&#x7684; SAVEPOINT&#xFF0C;&#x5219;&#x540E;&#x9762;&#x5B9A;&#x4E49;&#x7684; SAVEPOINT &#x4F1A;&#x8986;&#x76D6;&#x4E4B;&#x524D;&#x7684;&#x5B9A;&#x4E49;&#x3002; &#x5BF9;&#x4E8E;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684; SAVEPOINT&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; RELEASE SAVEPOINT &#x5220;&#x9664;&#xFF0C;&#x5220;&#x9664;&#x540E;&#x4E0D;&#x80FD;&#x518D;&#x6267;&#x884C; ROLLBACK TO SAVEPOINT&#x3002;</li><li>&#x9ED8;&#x8BA4;&#x91C7;&#x7528;&#x81EA;&#x52A8;&#x63D0;&#x4EA4;&#x6A21;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E; <code>autocommit</code> &#x6765;&#x542F;&#x7528;&#x6216;&#x7981;&#x7528;&#x81EA;&#x52A8;&#x63D0;&#x4EA4;&#x6A21;&#x5F0F;</li></ul><footer class="page-footer"><span class="copyright">powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x4EF6;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A; 2020-04-10 10:05:54</span></footer></section></div><div class="search-results"><div class="has-results"><h1 class="search-results-title"><span class="search-results-count"></span> results matching "<span class="search-query"></span>"</h1><ul class="search-results-list"></ul></div><div class="no-results"><h1 class="search-results-title">No results matching "<span class="search-query"></span>"</h1></div></div></div></div><div class="search-results"><div class="has-results"><h1 class="search-results-title"><span class="search-results-count"></span> results matching "<span class="search-query"></span>"</h1><ul class="search-results-list"></ul></div><div class="no-results"><h1 class="search-results-title">No results matching "<span class="search-query"></span>"</h1></div></div></div></div></div></div><a href="2.1.引擎.html" class="navigation navigation-prev" aria-label="Previous page: 引擎"><i class="fa fa-angle-left"></i> </a><a href="2.3.索引.html" class="navigation navigation-next" aria-label="Next page: 索引"><i class="fa fa-angle-right"></i></a></div><script>var gitbook=gitbook||[];gitbook.push(function(){gitbook.page.hasChanged({page:{title:"事务",level:"4.2.2",depth:2,next:{title:"索引",level:"4.2.3",depth:2,path:"数据库/2.3.索引.md",ref:"数据库/2.3.索引.md",articles:[]},previous:{title:"引擎",level:"4.2.1",depth:2,path:"数据库/2.1.引擎.md",ref:"数据库/2.1.引擎.md",articles:[]},dir:"ltr"},config:{plugins:["-splitter","-lunr","-sharing","simple-page-toc","search-plus","tbfed-pagefooter","favicon"],styles:{website:"styles/website.css",pdf:"styles/pdf.css",epub:"styles/epub.css",mobi:"styles/mobi.css",ebook:"styles/ebook.css",print:"styles/print.css"},pluginsConfig:{"theme-default":{styles:{website:"styles/website.css",pdf:"styles/pdf.css",epub:"styles/epub.css",mobi:"styles/mobi.css",ebook:"styles/ebook.css",print:"styles/print.css"},showLevel:!0},favicon:{shortcut:"favicon.ico",bookmark:"favicon.ico"},"simple-page-toc":{maxDepth:3,skipFirstH1:!0},"tbfed-pagefooter":{modify_label:"该文件修订时间：",modify_format:"YYYY-MM-DD HH:mm:ss"},"search-plus":{},highlight:{},search:{},fontsettings:{theme:"white",family:"sans",size:2}},theme:"default",author:"Aoang",pdf:{pageNumbers:!0,fontSize:12,fontFamily:"Arial",paperSize:"a4",chapterMark:"pagebreak",pageBreaksBefore:"/",margin:{right:62,left:62,top:56,bottom:56}},structure:{langs:"LANGS.md",readme:"README.md",glossary:"GLOSSARY.md",summary:"SUMMARY.md"},variables:{},title:"Aoang's Wiki",language:"zh-hans",gitbook:"*",description:"记录Gitbook的配置和一些插件的使用"},file:{path:"数据库/2.2.事务.md",mtime:"2020-04-10T10:05:54.898Z",type:"markdown"},gitbook:{version:"3.2.3",time:"2020-04-10T10:07:07.876Z"},basePath:"..",book:{language:""}})})</script></div><script src="../gitbook/gitbook.js"></script><script src="../gitbook/theme.js"></script><script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script><script src="../gitbook/gitbook-plugin-search-plus/search.js"></script><script src="../gitbook/gitbook-plugin-search/search-engine.js"></script><script src="../gitbook/gitbook-plugin-search/search.js"></script><script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script></body></html>